# 使用{}创建集合
st = {1, 2, 3, "hello", (55,)}
print(st)  # {1, 2, 3, (55,), 'hello'}

# 使用set创建集合
# st1 = set(1, 2, 3, "hello", (55,))  # 错误的写法
# st1 = set((1, 2, 3, "hello", (55,)))
st1 = set([1, 2, 3, "hello", (55,)])
print(st1)

# 使用集合推导式创建集合
st2 = {i for i in range(10)}
print(st2)


a = {10, 20, 30, 40, 50}
b = {10, 30, 50, 66, 90}

# 交集
print(a & b)  # {50, 10, 30}

# 并集
print(a | b)  # {66, 40, 10, 50, 20, 90, 30}

# 差集
print(a - b)  # {40, 20}

# 补集
print(a ^ b)  # {66, 20, 90, 40}


#######################################
s = {10, 20, 50}
# 向集合中添加元素
s.add(60)  # {10, 20, 50, 60}
print(s)

# 集合中成员删除
s.remove(20)
print(s)  # {10, 50, 60}

# 集合清除
s.clear()
print(bool(s))  # False
